In [1]:
# 04-Finding-Duplicate-Rows-01

In [2]:
# Another thing we need to worry about if we are using somenone else's data is 
# whether any data is duplicate. 
# Did the same data get reported twice, recorded twice, or just copied and pasted ?
# Sometimes we need to worry about that even if we did collect it by ourself
# It can be difficult to check the veracity of each and every data point, 
# but it is quite easy to check if the data is duplicated.

In [10]:
# Python's pandas library has a function for finding not only duplicated rows,
# but also the unique rows.

# Creating Dataset with Duplicates
import pandas as pd
names = ['Jan','John','Bob','Jan','Mary','Jon','Mel','Mel']
grades = [95,78,76,95,77,78,99,100]
GradeList = list(zip(names,grades))
df = pd.DataFrame(data=GradeList, columns=['Names','Grades'])
df

  Names  Grades
0   Jan      95
1  John      78
2   Bob      76
3   Jan      95
4  Mary      77
5   Jon      78
6   Mel      99
7   Mel     100

In [14]:
# Displaying only duplicates in the DataFrame[Duplicates]
df.duplicated()  # As the record number 3 is repeated, so it is a duplicated record

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7    False
dtype: bool

In [16]:
# Displaying Dataset without Duplicates[Unique records]
df.drop_duplicates()  # The 6th record will be removed and only the unique records will be displayed

  Names  Grades
0   Jan      95
1  John      78
2   Bob      76
4  Mary      77
5   Jon      78
6   Mel      99
7   Mel     100

In [17]:
# You might be asking, 
# "What if the entire row isn't duplicated, but I still know it's a duplicate? "
# This can happen if someone does your survey or retake an exam again, so the name is the same,
# but the observation is different.
# In this case, where we know that a duplicate name means a duplicate entry.

In [21]:
# Drop Rows with Duplicates Names, Keeping the last observation
df.drop_duplicates(['Names'],keep='last')

  Names  Grades
1  John      78
2   Bob      76
3   Jan      95
4  Mary      77
5   Jon      78
7   Mel     100

In [ ]:
# As you can see from te above o/p, the 0 and 6th records are dropped and 
# only its last instances are displayed.